Update flow chart to mermaid
Signed-off-by: Piet Gömpel <pietgoempel@gmail.com>
